# Berbagi Wawasan #1

[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/baraaksayeth/python-data-analytics/blob/main/index.ipynb)

## Membaca File CSV, XML, TXT, XLSX

In [1]:
import pandas as pd

pd.set_option('display.max_columns', None)

### File CSV

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/baraaksayeth/python-data-analytics/main/datasets/retail.csv')
df.head(n=15)

# sep = ','
# header = baris berapa yang mau dijadikan header
# names = [Kalo mau, merubah, nama, kolom]
# skiprows = baris berapa yang ingin di skip
# usecols = [Kolom, yang, mau, diambil]
# nrows = jumlah baris yang mau diambil

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2.0,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1.0,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5.0,42.53,15,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3.0,28.51,5,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3.0,60.77,0,182.31,Credit Card,Medan
5,INV0006,2025-01-06,CUST275,Male,42,Toothpaste,Personal,5.0,30.02,20,120.08,E-Wallet,Yogyakarta
6,INV0007,2025-01-03,CUST099,Male,20,Soap,Personal,2.0,77.53,0,155.06,Cash,Jakarta
7,INV0008,2025-03-31,CUST195,Female,47,Soap,Personal,3.0,17.10,10,46.17,Cash,Surabaya
8,INV0009,2025-04-30,CUST037,Male,52,Sneakers,Footwear,2.0,17.18,15,29.21,E-Wallet,Yogyakarta
9,INV0010,2025-01-18,CUST113,Female,21,Jeans,Apparel,1.0,80.70,15,68.59,E-Wallet,Jakarta
10,INV0011,2025-04-04,CUST109,Female,31,Soap,Personal,4.0,40.17,15,136.58,Cash,Surabaya
11,INV0012,2025-01-23,CUST072,Male,65,Notebook,Stationery,5.0,27.01,20,108.04,E-Wallet,Yogyakarta
12,INV0013,2025-01-05,CUST205,Female,32,T-shirt,Apparel,NaN,49.86,0,249.30,Cash,Bandung
13,INV0014,2025-03-06,CUST082,Female,56,Toothpaste,Personal,4.0,38.78,15,131.85,Credit Card,Surabaya
14,INV0015,2025-05-14,CUST284,Male,61,Sneakers,Footwear,1.0,68.49,20,54.79,E-Wallet,Surabaya

### File XLSX

In [18]:
df_excel = pd.read_excel('https://raw.githubusercontent.com/baraaksayeth/python-data-analytics/main/datasets/retail.xlsx', sheet_name=None)
df_excel['Worksheet'].head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5,42.53,15,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3,28.51,5,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3,60.77,0,182.31,Credit Card,Medan

### File TXT

In [4]:
df_txt = pd.read_csv('https://raw.githubusercontent.com/baraaksayeth/python-data-analytics/main/datasets/retail.txt', sep='\t')
df_txt.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5,42.53,15,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3,28.51,5,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3,60.77,0,182.31,Credit Card,Medan

### File XML

In [5]:
# Membaca file XML
df_xml = pd.read_xml('https://raw.githubusercontent.com/baraaksayeth/python-data-analytics/main/datasets/retail.xml')
df_xml.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5,42.53,15,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3,28.51,5,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3,60.77,0,182.31,Credit Card,Medan

In [8]:
# Membaca file xml yang bercabang

import xml.etree.ElementTree as ET
import requests

url = 'https://raw.githubusercontent.com/baraaksayeth/python-data-analytics/main/datasets/data.xml'
response = requests.get(url)

root = ET.fromstring(response.content)

data_karyawan = []

for dept in root.findall('departemen'):
  for karyawan in dept.findall('karyawan'):
    id = karyawan.get('id')
    nama = karyawan.findtext('nama')
    jabatan = karyawan.findtext('jabatan')
    umur = karyawan.findtext('umur')
    kontak = karyawan.find('kontak')
    email = kontak.findtext('email')
    telepon = kontak.findtext('telepon')
    
    data_karyawan.append({
      'id': id,
      'nama': nama,
      'umur': umur,
      'jabatan': jabatan,
      'email': email,
      'telepon': telepon
    })

df_xml = pd.DataFrame(data_karyawan)
df_xml.head()

  id   nama umur     jabatan                   email       telepon
0  1   Andi   30  Programmer   andi@majumundur.co.id   08123456789
1  2   Budi   28    Sysadmin   budi@majumundur.co.id   08987654321
2  3  Citra   32  HR Manager  citra@majumundur.co.id  082233445566

## Mengambil dari Database

### Instalasi library

In [ ]:
# Mengambil data dari database

!pip install pymysql sqlalchemy

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pymysql in c:\users\lenovo-1\appdata\roaming\python\python310\site-packages (1.1.1)
Requirement already satisfied: sqlalchemy in c:\users\lenovo-1\appdata\roaming\python\python310\site-packages (2.0.41)
Requirement already satisfied: greenlet>=1 in c:\users\lenovo-1\appdata\roaming\python\python310\site-packages (from sqlalchemy) (3.2.2)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\lenovo-1\appdata\roaming\python\python310\site-packages (from sqlalchemy) (4.13.2)

WARNING: You are using pip version 22.0.4; however, version 25.1.1 is available.
You should consider upgrading via the 'c:\Program Files\python\python.exe -m pip install --upgrade pip' command.

### Membuat Engine Koneksi

In [10]:
from sqlalchemy import create_engine

# mysql+pymsql://user:password@host:port/database

engine = create_engine('mysql+pymysql://sales_user:syzlau#123@103.163.139.132:3306/sales')

### Mengambil Data

In [11]:
sql = "SELECT * FROM retail_data"

df_sql = pd.read_sql(sql, engine)
df_sql.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2,23.10,0.0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1,22.65,20.0,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5,42.53,15.0,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3,28.51,5.0,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3,60.77,0.0,182.31,Credit Card,Medan

## Basic Data Manipulation

### Sorting

In [ ]:
# Sorting kolom
df_sorted = df.sort_values(by='Date', ascending=False)

# Sorting multi columns
df_sorted = df.sort_values(by=['Date', 'CustomerID'], ascending=[False, False])
df_sorted.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
667,INV0668,2025-05-15,CUST265,Male,47,Soap,Personal,4,9.95,20,31.84,Cash,Bandung
934,INV0935,2025-05-15,CUST119,Male,55,Soap,Personal,3,92.25,15,235.24,Cash,Surabaya
289,INV0290,2025-05-15,CUST009,Male,52,Notebook,Stationery,4,2.17,20,6.94,Credit Card,Surabaya
14,INV0015,2025-05-14,CUST284,Male,61,Sneakers,Footwear,1,68.49,20,54.79,E-Wallet,Surabaya
32,INV0033,2025-05-14,CUST261,Male,29,Toothpaste,Personal,5,7.73,5,36.72,E-Wallet,Jakarta

### Sorting dengan menggunakan lambda

In [13]:
df_sorted = df.sort_values(by='Product', key=lambda x: x.str.len(), ascending=False)
df_sorted.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
500,INV0501,2024-12-05,CUST080,Male,27,Instant Noodles,Groceries,5.0,6.03,20,24.12,Credit Card,Surabaya
226,INV0227,2024-12-15,CUST215,Male,28,Instant Noodles,Groceries,5.0,72.39,5,343.85,Cash,Medan
600,INV0601,2025-04-09,CUST008,Female,31,Instant Noodles,Groceries,4.0,31.85,15,108.29,E-Wallet,Medan
598,INV0599,2024-12-01,CUST140,Female,30,Instant Noodles,Groceries,1.0,16.06,20,12.85,Cash,Bandung
203,INV0204,2024-11-29,CUST165,Male,23,Instant Noodles,Groceries,3.0,31.34,20,75.22,Credit Card,Medan

### Replace

In [ ]:
# Replace Data
df['Location'] = df['Location'].replace('Jakarta', 'DKI Jakarta')

# Mengganti nilai None dengan 0
df['Quantity'] = df['Quantity'].fillna(0)

df.head(15)

In [ ]:
# Replace banyak nilai sekaligus
df['PaymentMethod'] = df['PaymentMethod'].replace({
    'Credit Card': 'CC',
    'E-Wallet': 'EW'
})

In [ ]:
# Replace Menggunakan Regex
df['Category'] = df['Category'].replace(r'[^a-zA-Z0-9]', '', regex=True)

In [88]:
# Replace Menggunakan Lambda

df['StatusDiscount'] = df['Discount'].apply(
  lambda x: 'Tanpa Diskon' if x == 0 else 'Menggunakan Diskon'
)

df.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location,StatusDiscount
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2.0,23.10,0,46.20,Credit Card,Yogyakarta,Tanpa Diskon
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1.0,22.65,20,18.12,Credit Card,DKI Jakarta,Menggunakan Diskon
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5.0,42.53,15,180.75,Credit Card,Surabaya,Menggunakan Diskon
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3.0,28.51,5,81.25,E-Wallet,DKI Jakarta,Menggunakan Diskon
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3.0,60.77,0,182.31,Credit Card,Medan,Tanpa Diskon

### Drop Data

In [ ]:
# Hapus Kolom
df.drop('Age', axis=1, inplace=True)
df.head()

,InvoiceNo,Date,CustomerID,Gender,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,Rice 5kg,Groceries,2,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,Shampoo,Personal,1,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,Soap,Personal,5,42.53,15,180.75,Credit Card,Surabaya
3,INV0004,2025-02-18,CUST004,Male,Milk 1L,Dairy,3,28.51,5,81.25,E-Wallet,Jakarta
4,INV0005,2025-03-25,CUST048,Female,Instant Noodles,Groceries,3,60.77,0,182.31,Credit Card,Medan

In [59]:
# Hapus Baris
df.drop(3, axis=0, inplace=True)
df.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2,23.10,0,46.20,Credit Card,Yogyakarta
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1,22.65,20,18.12,Credit Card,Jakarta
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5,42.53,15,180.75,Credit Card,Surabaya
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3,60.77,0,182.31,Credit Card,Medan
5,INV0006,2025-01-06,CUST275,Male,42,Toothpaste,Personal,5,30.02,20,120.08,E-Wallet,Yogyakarta

In [67]:
# Cek data mana aja yang duplikat
dupes = df[df.duplicated(subset=['CustomerID', 'Product'])]
dupes.head()

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
42,INV0043,2025-02-16,CUST058,Male,62,T-shirt,Apparel,5,4.57,10,20.57,Credit Card,Yogyakarta
147,INV0148,2025-02-28,CUST051,Male,59,Soap,Personal,5,72.36,5,343.71,E-Wallet,Medan
164,INV0165,2025-04-06,CUST208,Male,38,T-shirt,Apparel,5,46.55,10,209.47,Cash,Medan
172,INV0173,2025-02-04,CUST047,Female,47,Pen,Stationery,5,95.47,0,477.35,E-Wallet,Yogyakarta
179,INV0180,2024-12-23,CUST048,Female,50,Instant Noodles,Groceries,1,36.90,5,35.05,Cash,Surabaya

In [ ]:
# Menghapus Duplikasi
df.drop_duplicates(inplace=True)

# Menghapus Duplikasi berdasarkan Kolom
df.drop_duplicates(subset=['Date', 'CustomerID',], inplace=True, keep='last')

### Filtering Data

In [ ]:
# Filtering

# Pelanggan yang mendapatkan diskon lebih dari 10% dan Total lebih dari 5
df[(df['Discount'] > 10) & (df['Total'] > 100)]

# Semua transaksi oleh pelanggan berusia di bawah 30 dan lokasi di Surabaya atau Bandung
df[ (df['Age'] < 30) & (df['Location'].isin(['Surabayar', 'Bandung'])) ]

# Mencari data produk yang mengandung sebuah kata
df[df['Product'].str.contains('Milk', case=False)]

# Mencar data produk yang mengandung lebih dari 10 karakter
df[ df['Product'].str.len() > 10 ]

# Mengambil TOP N (baris dengan nilai tertinggi)
df.nlargest(3, 'Total')

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3.0,60.77,0,182.31,Credit Card,Medan
17,INV0018,2025-02-03,CUST277,Male,56,Instant Noodles,Groceries,4.0,2.93,10,10.55,E-Wallet,Bandung
39,INV0040,2024-12-16,CUST145,Male,63,Instant Noodles,Groceries,2.0,69.06,10,124.31,Credit Card,Medan
48,INV0049,2024-11-21,CUST143,Male,35,Instant Noodles,Groceries,5.0,40.57,20,162.28,E-Wallet,Jakarta
52,INV0053,2025-04-25,CUST036,Female,57,Instant Noodles,Groceries,1.0,72.26,10,65.03,Credit Card,Surabaya
...,...,...,...,...,...,...,...,...,...,...,...,...,...
896,INV0897,2025-04-20,CUST286,Male,21,Instant Noodles,Groceries,2.0,47.62,10,85.72,Credit Card,Yogyakarta
907,INV0908,2025-02-16,CUST146,Male,43,Instant Noodles,Groceries,5.0,92.99,0,464.95,E-Wallet,Bandung
958,INV0959,2025-02-08,CUST194,Male,24,Instant Noodles,Groceries,5.0,58.65,10,263.93,E-Wallet,Jakarta
965,INV0966,2025-02-13,CUST061,Female,37,Instant Noodles,Groceries,3.0,30.10,0,90.30,Cash,Bandung
983,INV0984,2024-11-25,CUST257,Male,27,Instant Noodles,Groceries,5.0,98.55,5,468.11,Credit Card,Medan

In [16]:
# Mengambil pembelian yang total nya lebih dari rata-rata

mean_total = df['Total'].mean()
print(mean_total)

df[ df['Total'] > mean_total ]

136.83557000000002

,InvoiceNo,Date,CustomerID,Gender,Age,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5.0,42.53,15,180.75,Credit Card,Surabaya
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3.0,60.77,0,182.31,Credit Card,Medan
6,INV0007,2025-01-03,CUST099,Male,20,Soap,Personal,2.0,77.53,0,155.06,Cash,Jakarta
12,INV0013,2025-01-05,CUST205,Female,32,T-shirt,Apparel,NaN,49.86,0,249.30,Cash,Bandung
16,INV0017,2025-01-21,CUST260,Male,58,Rice 5kg,Groceries,5.0,61.29,5,291.13,E-Wallet,Bandung
...,...,...,...,...,...,...,...,...,...,...,...,...,...
990,INV0991,2025-05-11,CUST003,Male,61,T-shirt,Apparel,4.0,56.02,15,190.47,E-Wallet,Yogyakarta
991,INV0992,2024-11-15,CUST042,Male,52,Shampoo,Personal,4.0,67.55,10,243.18,E-Wallet,Yogyakarta
993,INV0994,2025-02-27,CUST005,Male,65,Shampoo,Personal,3.0,68.37,10,184.60,Cash,Jakarta
996,INV0997,2025-02-13,CUST253,Male,53,Jeans,Apparel,5.0,67.55,20,270.20,Credit Card,Bandung
998,INV0999,2025-02-26,CUST141,Male,61,Shampoo,Personal,5.0,61.83,20,247.32,E-Wallet,Jakarta

In [17]:
# Hitung total penjualan per tanggal

print(df.shape)

df['Date'] = pd.to_datetime(df['Date'])

penjualan_per_hari = df.groupby('Date')['Total'].sum().reset_index()

print(penjualan_per_hari)

(1000, 13)
          Date    Total
0   2024-11-14   293.68
1   2024-11-15   300.40
2   2024-11-16   880.69
3   2024-11-17   938.84
4   2024-11-18   829.02
..         ...      ...
178 2025-05-11  1074.59
179 2025-05-12   424.67
180 2025-05-13   704.45
181 2025-05-14   703.21
182 2025-05-15   274.02

[183 rows x 2 columns]

### Joining Dataframes

In [107]:
# Menggabungkan 2 dataset dengan kolom
df_customer = pd.read_csv('datasets/customer.csv')

df_customer.head()

  CustomerID                  Name  Gender  Age    Location
0    CUST001         Desiree Tyler  Female   68    Makassar
1    CUST002        Nicole Fischer  Female   62    Makassar
2    CUST003  Melissa Mitchell DDS  Female   42  Yogyakarta
3    CUST004          Lori Johnson    Male   62    Makassar
4    CUST005           Amy Rosales    Male   51       Medan

In [108]:
df_lengkap = pd.merge(df, df_customer, on='CustomerID', how='inner')
df_lengkap.head()

,InvoiceNo,Date,CustomerID,Gender_x,Age_x,Product,Category,Quantity,Price,Discount,Total,PaymentMethod,Location_x,Name,Gender_y,Age_y,Location_y
0,INV0001,2024-12-19,CUST058,Male,65,Rice 5kg,Groceries,2.0,23.10,0,46.20,Credit Card,Yogyakarta,James Garrett,Female,70,Denpasar
1,INV0002,2025-02-22,CUST045,Female,20,Shampoo,Personal,1.0,22.65,20,18.12,Credit Card,Jakarta,Jennifer Kennedy,Female,20,Medan
2,INV0003,2025-01-19,CUST288,Male,63,Soap,Personal,5.0,42.53,15,180.75,Credit Card,Surabaya,Brandy Flores,Female,53,Makassar
3,INV0004,2025-02-18,CUST004,Male,62,Milk 1L,Dairy,3.0,28.51,5,81.25,E-Wallet,Jakarta,Lori Johnson,Male,62,Makassar
4,INV0005,2025-03-25,CUST048,Female,24,Instant Noodles,Groceries,3.0,60.77,0,182.31,Credit Card,Medan,Robert Meyers,Female,31,Surabaya

In [ ]:
transaksi_per_customer = df_lengkap.groupby('CustomerID').size().reset_index(name='TotalTransaksi')
transaksi_per_customer.head()

result = pd.merge(transaksi_per_customer, df_customer, on='CustomerID', how='inner')
result = result[['CustomerID', 'Name', 'TotalTransaksi']]
result.head()

  CustomerID                  Name  TotalTransaksi
0    CUST001         Desiree Tyler               3
1    CUST002        Nicole Fischer               1
2    CUST003  Melissa Mitchell DDS               6
3    CUST004          Lori Johnson               5
4    CUST005           Amy Rosales               2

In [115]:
transaksi_per_customer = df_lengkap.groupby('CustomerID').agg(
  TotalTransaksi=('InvoiceNo', 'count'),
  TotalSpent=('Total', 'sum')
).reset_index()

transaksi_per_customer.head()

  CustomerID  TotalTransaksi  TotalSpent
0    CUST001               3      413.42
1    CUST002               1      122.60
2    CUST003               6     1124.81
3    CUST004               5      764.72
4    CUST005               2      395.27

In [116]:
# Membuat resume transaksi per tanggal
summary_per_tanggal = df_lengkap.groupby('Date').agg(
  TotalCustomer=('CustomerID', 'nunique'),
  TotalSpent=('Total', 'sum')
).reset_index()

summary_per_tanggal.head()

         Date  TotalCustomer  TotalSpent
0  2024-11-14              4      293.68
1  2024-11-15              2      300.40
2  2024-11-16              7      880.69
3  2024-11-17              6      938.84
4  2024-11-18              7      829.02